package faq

import (
	"main/internal/models"
	"main/internal/storage"
)

var Seed = []models.Faq{
	{
		Name:     "ტექნოლოგიური კომპანია",
		Slug:     "1",
		Question: "რა არის alfashop და რა საქმე აკეთებს კომპანია?",
		Answer:   "alfashop არის მნიშვნელოვანი ტექნოლოგიური კომპანია, რომელიც გთავაზობთ ამბავსა და მედიის გამოყენებას.",
	},
	{
		Name:     "პროდუქტები",
		Slug:     "2",
		Question: "alfashop-ს პროდუქტები როგორ შეიძლება ვიყოთ მიმწოდებელი?",
		Answer:   "alfashop-ს პროდუქტები შეიძლება შეიძლებონ ყველას, ვინც გსურს მოსაწყენებლად იყოს კურიერი ან მაღაზიაში.",
	},
	{
		Name:     "კონტაქტი",
		Slug:     "3",
		Question: "როგორ შემოგვედით კომპანიას alfashop?",
		Answer:   "alfashop-ს შესახებ შეგიძლიათ გამოგვიყენოთ ინტერნეტის გვერდი ან ჩვენი კონტაქტური ინფორმაცია.",
	},
	{
		Name:     "პროდუქტების განყოფილება",
		Slug:     "4",
		Question: "alfashop-ს პროდუქტების განყოფილება როგორ ხდება?",
		Answer:   "alfashop-ს პროდუქტები განაწილება ხდება ჩვენი ადგილებზე ან კლიენტის შერჩევით შესწორებული მეთოდით.",
	},
	{
		Name:     "კონტაქტი",
		Slug:     "5",
		Question: "თუ მოხდა შეცდომა ან მივიღეთ ანგარიშის დასაბრუნებლად სად უნდა მივიღოთ კონტაქტი?",
		Answer:   "შეცდომების დასაბრუნებლად და სხვა შეკითხვებისთვის შეგიძლიათ დაგვიკავშირდეთ ჩვენს გუნდს.",
	},
	{
		Name:     "ბაზა და დისტრიბუციული სისტემა",
		Slug:     "6",
		Question: "როგორ მუშაობს alfashop-ს ბაზა და დისტრიბუციული სისტემა?",
		Answer:   "alfashop-ს ბაზა და დისტრიბუციული სისტემა მუშაობს სწრაფად და ეფექტურად ჩვენი კლიენტების მისაღებად.",
	},
	{
		Name:     "უფლებები და წესები",
		Slug:     "7",
		Question: "alfashop-ს მომხმარებელთა უფლებები და კომპანიის წესები.",
		Answer:   "ჩვენ ვყავით ჩვენს მომხმარებელთა უფლებებს და მივიღებთ მათი სურათების დაპასუხების უფლებებს.",
	},
	{
		Name:     "შეკვეთა",
		Slug:     "8",
		Question: "როგორ შევიყვანოთ შეკვეთა alfashop-ს პროდუქტებზე?",
		Answer:   "შეკვეთა შესაძლებელია ჩვენი ვებგვერდის საშუალებით ან მაღაზიაში.",
	},
	{
		Name:     "ვებგვერდი",
		Slug:     "9",
		Question: "alfashop-ს საკუთარი საიტის ფუნქციონალის შესახებ.",
		Answer:   "ჩვენი ვებგვერდი შეიცავს ჩვენს პროდუქტებსა და სხვა ინფორმაციას.",
	},
	{
		Name:     "ინფორმაცია",
		Slug:     "10",
		Question: "სხვა ინფორმაცია და დასახელება შესაბამისი alfashop-ს კომპანიის შესახებ.",
		Answer:   "თუ გსურთ მეტი ინფორმაცია alfashop-ს შესახებ, გთხოვთ, მოგვწერეთ და გადაგიხდეთ ჩვენს გუნდს.",
	},
}

func Populate() {
	for _, row := range Seed {
		storage.DB.Create(&row)
	}
}
